[
  {"type": "cambridge", "text": "Access to clean water is a basic human right. Every home should have a water supply provided free of charge. Do you agree or disagree? (Cambridge IELTS 20)"},
  {"type": "cambridge", "text": "Primary and secondary schools close for two months or more for summer holidays. What is the value of this? What are the arguments for shorter holidays? (Cambridge IELTS 20)"},
  {"type": "cambridge", "text": "Some people have decided to reduce their air travel or stop flying altogether. Do the environmental benefits outweigh the disadvantages for individuals and businesses? (Cambridge IELTS 20)"},
  {"type": "cambridge", "text": "Global fashion trends now influence how people dress. Why is this happening? Is it a positive or negative development? (Cambridge IELTS 20)"},
  {"type": "cambridge", "text": "Some people think competition at work, school, and daily life is good. Others think we should cooperate more. Discuss both these views and give your own opinion. (Cambridge IELTS 19)"},
  {"type": "cambridge", "text": "The working week should be shorter and employees should have a longer weekend. Do you agree or disagree? (Cambridge IELTS 19)"},
  {"type": "cambridge", "text": "It is important for everyone, including young people, to save money for their future. Do you agree or disagree? (Cambridge IELTS 19)"},
  {"type": "cambridge", "text": "Consumers can now buy food from all over the world in supermarkets. Is this a positive or negative development? (Cambridge IELTS 19)"},
  {"type": "cambridge", "text": "The most important aim of science should be to improve people’s lives. Do you agree or disagree? (Cambridge IELTS 18)"},
  {"type": "cambridge", "text": "Some university students want to learn other subjects in addition to their main subject. Others think they should focus only on their qualification. Discuss both these views and give your own opinion. (Cambridge IELTS 18)"},
  {"type": "cambridge", "text": "Rural people are moving to cities, decreasing the countryside population. Is this a positive or negative development? (Cambridge IELTS 18)"},
  {"type": "cambridge", "text": "People are living longer. Does the advantage of having more elderly people in society outweigh the disadvantage of the problems this creates for governments? (Cambridge IELTS 18)"},
  {"type": "cambridge", "text": "It is important for people to take risks, both in their professional and personal lives. Do the advantages outweigh the disadvantages? (Cambridge IELTS 17)"},
  {"type": "cambridge", "text": "Some think professionals (e.g., doctors, engineers) should work in the country where they trained. Others think they should be free to work anywhere. Discuss both these views and give your own opinion. (Cambridge IELTS 17)"},
  {"type": "cambridge", "text": "Many young people spend a significant amount of time on their smartphones every day. Why is this? Is it a positive or negative development? (Cambridge IELTS 17)"},
  {"type": "cambridge", "text": "More people are using alternative medicines and treatments instead of visiting a doctor. Is this a positive or negative development? (Cambridge IELTS 17)"},
  {"type": "cambridge", "text": "More people are interested in the history of the house or building they live in. What are the reasons? How can they research this? (Cambridge IELTS 16)"},
  {"type": "cambridge", "text": "Advertisements often emphasize that products are \"new\" in some way. Why is this? Is it a positive or negative development? (Cambridge IELTS 16)"},
  {"type": "cambridge", "text": "Sugary products should be made more expensive to encourage people to consume less sugar. Do you agree or disagree? (Cambridge IELTS 16)"},
  {"type": "cambridge", "text": "In the future, all vehicles will be driverless. Do the advantages of this outweigh the disadvantages? (Cambridge IELTS 16)"},
  {"type": "cambridge", "text": "Owning a home is very important to many people. Why is this? Is it a positive or negative situation? (Cambridge IELTS 15)"},
  {"type": "cambridge", "text": "In the future, nobody will buy printed newspapers or books because they can read everything online for free. Do you agree or disagree? (Cambridge IELTS 15)"},
  {"type": "cambridge", "text": "Some say advertising is successful at persuading us to buy. Others say we no longer pay attention to it. Discuss both these views and give your own opinion. (Cambridge IELTS 15)"},
  {"type": "cambridge", "text": "In some cultures, children are told they can achieve anything if they try hard enough. What are the advantages and disadvantages of giving this message? (Cambridge IELTS 15)"},
  {"type": "cambridge", "text": "Some say it is best to accept a bad situation (e.g., bad job, no money). Others say it is better to try and improve it. Discuss both these views and give your own opinion. (Cambridge IELTS 14)"},
  {"type": "cambridge", "text": "The loss of species is the main environmental problem. Others say there are more significant environmental problems. Discuss both and give your opinion. (Cambridge IELTS 14)"},
  {"type": "cambridge", "text": "Some say music is a good way of bringing people of different cultures and ages together. To what extent do you agree? (Cambridge IELTS 14)"},
  {"type": "cambridge", "text": "Many people choose to be self-employed rather than work for a company. Why is this? What are the disadvantages? (Cambridge IELTS 14)"},
  {"type": "cambridge", "text": "Living in a country where you have to speak a foreign language can cause serious social and practical problems. To what extent do you agree? (Cambridge IELTS 13)"},
  {"type": "cambridge", "text": "Some believe that nowadays we have too many choices. To what extent do you agree or disagree? (Cambridge IELTS 13)"},
  {"type": "cambridge", "text": "Some say history is one of the most important school subjects. Others say science and technology are more important. Discuss both these views and give your own opinion. (Cambridge IELTS 13)"},
  {"type": "cambridge", "text": "Some say there is no need to go to the cinema now that we can watch films on phones/tablets. Others say films should be seen in a cinema. Discuss both these views and give your own opinion. (Cambridge IELTS 13)"},
  {"type": "cambridge", "text": "Some believe we should share all scientific/business info freely. Others believe some info is too valuable to share. Discuss both these views and give your own opinion. (Cambridge IELTS 12)"},
  {"type": "cambridge", "text": "In some countries, there are more young adults than older people. Do the advantages outweigh the disadvantages? (Cambridge IELTS 12)"},
  {"type": "cambridge", "text": "Some say we should spend money on new high-speed railways. Others say we should improve existing public transport. Discuss both these views and give your own opinion. (Cambridge IELTS 12)"},
  {"type": "cambridge", "text": "Some say children should make their own choices (food, clothes). Others say they should only make decisions on matters that affect them directly. Discuss both these views and give your own opinion. (Cambridge IELTS 12)"},
  {"type": "cambridge", "text": "Governments should spend money on railways rather than roads. To what extent do you agree? (Cambridge IELTS 11)"},
  {"type": "cambridge", "text": "The only way to increase recycling is for governments to make it a legal requirement. To what extent do you agree? (Cambridge IELTS 11)"},
  {"type": "cambridge", "text": "Some say the only purpose of work is to earn money. Others say it improves society. Discuss both these views and give your own opinion. (Cambridge IELTS 11)"},
  {"type": "cambridge", "text": "Governments think economic progress is the most important goal. Others think other types of progress are equally important. Discuss both these views and give your own opinion. (Cambridge IELTS 11)"}
]
